OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1579.h
/*
 * This declarations of the PIC16LF1579 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:09 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC16LF1579_H__
#define __PIC16LF1579_H__

//==============================================================================
//
//	Register Addresses
//
//==============================================================================

#ifndef NO_ADDR_DEFINES

#define INDF0_ADDR              0x0000
#define INDF1_ADDR              0x0001
#define PCL_ADDR                0x0002
#define STATUS_ADDR             0x0003
#define FSR0_ADDR               0x0004
#define FSR0L_ADDR              0x0004
#define FSR0H_ADDR              0x0005
#define FSR1_ADDR               0x0006
#define FSR1L_ADDR              0x0006
#define FSR1H_ADDR              0x0007
#define BSR_ADDR                0x0008
#define WREG_ADDR               0x0009
#define PCLATH_ADDR             0x000A
#define INTCON_ADDR             0x000B
#define PORTA_ADDR              0x000C
#define PORTB_ADDR              0x000D
#define PORTC_ADDR              0x000E
#define PIR1_ADDR               0x0011
#define PIR2_ADDR               0x0012
#define PIR3_ADDR               0x0013
#define TMR0_ADDR               0x0015
#define TMR1_ADDR               0x0016
#define TMR1L_ADDR              0x0016
#define TMR1H_ADDR              0x0017
#define T1CON_ADDR              0x0018
#define T1GCON_ADDR             0x0019
#define TMR2_ADDR               0x001A
#define PR2_ADDR                0x001B
#define T2CON_ADDR              0x001C
#define TRISA_ADDR              0x008C
#define TRISB_ADDR              0x008D
#define TRISC_ADDR              0x008E
#define PIE1_ADDR               0x0091
#define PIE2_ADDR               0x0092
#define PIE3_ADDR               0x0093
#define OPTION_REG_ADDR         0x0095
#define PCON_ADDR               0x0096
#define WDTCON_ADDR             0x0097
#define OSCTUNE_ADDR            0x0098
#define OSCCON_ADDR             0x0099
#define OSCSTAT_ADDR            0x009A
#define ADRES_ADDR              0x009B
#define ADRESL_ADDR             0x009B
#define ADRESH_ADDR             0x009C
#define ADCON0_ADDR             0x009D
#define ADCON1_ADDR             0x009E
#define ADCON2_ADDR             0x009F
#define LATA_ADDR               0x010C
#define LATB_ADDR               0x010D
#define LATC_ADDR               0x010E
#define CM1CON0_ADDR            0x0111
#define CM1CON1_ADDR            0x0112
#define CM2CON0_ADDR            0x0113
#define CM2CON1_ADDR            0x0114
#define CMOUT_ADDR              0x0115
#define BORCON_ADDR             0x0116
#define FVRCON_ADDR             0x0117
#define DACCON0_ADDR            0x0118
#define DACCON1_ADDR            0x0119
#define ANSELA_ADDR             0x018C
#define ANSELB_ADDR             0x018D
#define ANSELC_ADDR             0x018E
#define PMADR_ADDR              0x0191
#define PMADRL_ADDR             0x0191
#define PMADRH_ADDR             0x0192
#define PMDAT_ADDR              0x0193
#define PMDATL_ADDR             0x0193
#define PMDATH_ADDR             0x0194
#define PMCON1_ADDR             0x0195
#define PMCON2_ADDR             0x0196
#define RCREG_ADDR              0x0199
#define TXREG_ADDR              0x019A
#define SPBRG_ADDR              0x019B
#define SPBRGL_ADDR             0x019B
#define SPBRGH_ADDR             0x019C
#define RCSTA_ADDR              0x019D
#define TXSTA_ADDR              0x019E
#define BAUDCON_ADDR            0x019F
#define WPUA_ADDR               0x020C
#define WPUB_ADDR               0x020D
#define WPUC_ADDR               0x020E
#define ODCONA_ADDR             0x028C
#define ODCONB_ADDR             0x028D
#define ODCONC_ADDR             0x028E
#define SLRCONA_ADDR            0x030C
#define SLRCONB_ADDR            0x030D
#define SLRCONC_ADDR            0x030E
#define INLVLA_ADDR             0x038C
#define INLVLB_ADDR             0x038D
#define INLVLC_ADDR             0x038E
#define IOCAP_ADDR              0x0391
#define IOCAN_ADDR              0x0392
#define IOCAF_ADDR              0x0393
#define IOCBP_ADDR              0x0394
#define IOCBN_ADDR              0x0395
#define IOCBF_ADDR              0x0396
#define IOCCP_ADDR              0x0397
#define IOCCN_ADDR              0x0398
#define IOCCF_ADDR              0x0399
#define CWG1DBR_ADDR            0x0691
#define CWG1DBF_ADDR            0x0692
#define CWG1CON0_ADDR           0x0693
#define CWG1CON1_ADDR           0x0694
#define CWG1CON2_ADDR           0x0695
#define PWMEN_ADDR              0x0D8E
#define PWMLD_ADDR              0x0D8F
#define PWMOUT_ADDR             0x0D90
#define PWM1PH_ADDR             0x0D91
#define PWM1PHL_ADDR            0x0D91
#define PWM1PHH_ADDR            0x0D92
#define PWM1DC_ADDR             0x0D93
#define PWM1DCL_ADDR            0x0D93
#define PWM1DCH_ADDR            0x0D94
#define PWM1PR_ADDR             0x0D95
#define PWM1PRL_ADDR            0x0D95
#define PWM1PRH_ADDR            0x0D96
#define PWM1OF_ADDR             0x0D97
#define PWM1OFL_ADDR            0x0D97
#define PWM1OFH_ADDR            0x0D98
#define PWM1TMR_ADDR            0x0D99
#define PWM1TMRL_ADDR           0x0D99
#define PWM1TMRH_ADDR           0x0D9A
#define PWM1CON_ADDR            0x0D9B
#define PWM1INTCON_ADDR         0x0D9C
#define PWM1INTE_ADDR           0x0D9C
#define PWM1INTF_ADDR           0x0D9D
#define PWM1INTFLG_ADDR         0x0D9D
#define PWM1CLKCON_ADDR         0x0D9E
#define PWM1LDCON_ADDR          0x0D9F
#define PWM1OFCON_ADDR          0x0DA0
#define PWM2PH_ADDR             0x0DA1
#define PWM2PHL_ADDR            0x0DA1
#define PWM2PHH_ADDR            0x0DA2
#define PWM2DC_ADDR             0x0DA3
#define PWM2DCL_ADDR            0x0DA3
#define PWM2DCH_ADDR            0x0DA4
#define PWM2PR_ADDR             0x0DA5
#define PWM2PRL_ADDR            0x0DA5
#define PWM2PRH_ADDR            0x0DA6
#define PWM2OF_ADDR             0x0DA7
#define PWM2OFL_ADDR            0x0DA7
#define PWM2OFH_ADDR            0x0DA8
#define PWM2TMR_ADDR            0x0DA9
#define PWM2TMRL_ADDR           0x0DA9
#define PWM2TMRH_ADDR           0x0DAA
#define PWM2CON_ADDR            0x0DAB
#define PWM2INTCON_ADDR         0x0DAC
#define PWM2INTE_ADDR           0x0DAC
#define PWM2INTF_ADDR           0x0DAD
#define PWM2INTFLG_ADDR         0x0DAD
#define PWM2CLKCON_ADDR         0x0DAE
#define PWM2LDCON_ADDR          0x0DAF
#define PWM2OFCON_ADDR          0x0DB0
#define PWM3PH_ADDR             0x0DB1
#define PWM3PHL_ADDR            0x0DB1
#define PWM3PHH_ADDR            0x0DB2
#define PWM3DC_ADDR             0x0DB3
#define PWM3DCL_ADDR            0x0DB3
#define PWM3DCH_ADDR            0x0DB4
#define PWM3PR_ADDR             0x0DB5
#define PWM3PRL_ADDR            0x0DB5
#define PWM3PRH_ADDR            0x0DB6
#define PWM3OF_ADDR             0x0DB7
#define PWM3OFL_ADDR            0x0DB7
#define PWM3OFH_ADDR            0x0DB8
#define PWM3TMR_ADDR            0x0DB9
#define PWM3TMRL_ADDR           0x0DB9
#define PWM3TMRH_ADDR           0x0DBA
#define PWM3CON_ADDR            0x0DBB
#define PWM3INTCON_ADDR         0x0DBC
#define PWM3INTE_ADDR           0x0DBC
#define PWM3INTF_ADDR           0x0DBD
#define PWM3INTFLG_ADDR         0x0DBD
#define PWM3CLKCON_ADDR         0x0DBE
#define PWM3LDCON_ADDR          0x0DBF
#define PWM3OFCON_ADDR          0x0DC0
#define PWM4PH_ADDR             0x0DC1
#define PWM4PHL_ADDR            0x0DC1
#define PWM4PHH_ADDR            0x0DC2
#define PWM4DC_ADDR             0x0DC3
#define PWM4DCL_ADDR            0x0DC3
#define PWM4DCH_ADDR            0x0DC4
#define PWM4PR_ADDR             0x0DC5
#define PWM4PRL_ADDR            0x0DC5
#define PWM4PRH_ADDR            0x0DC6
#define PWM4OF_ADDR             0x0DC7
#define PWM4OFL_ADDR            0x0DC7
#define PWM4OFH_ADDR            0x0DC8
#define PWM4TMR_ADDR            0x0DC9
#define PWM4TMRL_ADDR           0x0DC9
#define PWM4TMRH_ADDR           0x0DCA
#define PWM4CON_ADDR            0x0DCB
#define PWM4INTCON_ADDR         0x0DCC
#define PWM4INTE_ADDR           0x0DCC
#define PWM4INTF_ADDR           0x0DCD
#define PWM4INTFLG_ADDR         0x0DCD
#define PWM4CLKCON_ADDR         0x0DCE
#define PWM4LDCON_ADDR          0x0DCF
#define PWM4OFCON_ADDR          0x0DD0
#define PPSLOCK_ADDR            0x0E0F
#define INTPPS_ADDR             0x0E10
#define T0CKIPPS_ADDR           0x0E11
#define T1CKIPPS_ADDR           0x0E12
#define T1GPPS_ADDR             0x0E13
#define CWG1INPPS_ADDR          0x0E14
#define RXPPS_ADDR              0x0E15
#define CKPPS_ADDR              0x0E16
#define ADCACTPPS_ADDR          0x0E17
#define RA0PPS_ADDR             0x0E90
#define RA1PPS_ADDR             0x0E91
#define RA2PPS_ADDR             0x0E92
#define RA4PPS_ADDR             0x0E94
#define RA5PPS_ADDR             0x0E95
#define RB4PPS_ADDR             0x0E9C
#define RB5PPS_ADDR             0x0E9D
#define RB6PPS_ADDR             0x0E9E
#define RB7PPS_ADDR             0x0E9F
#define RC0PPS_ADDR             0x0EA0
#define RC1PPS_ADDR             0x0EA1
#define RC2PPS_ADDR             0x0EA2
#define RC3PPS_ADDR             0x0EA3
#define RC4PPS_ADDR             0x0EA4
#define RC5PPS_ADDR             0x0EA5
#define RC6PPS_ADDR             0x0EA6
#define RC7PPS_ADDR             0x0EA7
#define STATUS_SHAD_ADDR        0x0FE4
#define WREG_SHAD_ADDR          0x0FE5
#define BSR_SHAD_ADDR           0x0FE6
#define PCLATH_SHAD_ADDR        0x0FE7
#define FSR0L_SHAD_ADDR         0x0FE8
#define FSR0_SHAD_ADDR          0x0FE8
#define FSR0H_SHAD_ADDR         0x0FE9
#define FSR1L_SHAD_ADDR         0x0FEA
#define FSR1_SHAD_ADDR          0x0FEA
#define FSR1H_SHAD_ADDR         0x0FEB
#define STKPTR_ADDR             0x0FED
#define TOS_ADDR                0x0FEE
#define TOSL_ADDR               0x0FEE
#define TOSH_ADDR               0x0FEF

#endif // #ifndef NO_ADDR_DEFINES

//==============================================================================
//
//	Register Definitions
//
//==============================================================================

