OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1579.h
extern __at(0x0692) volatile __CWG1DBFbits_t CWG1DBFbits;

#define _CWG1DBF0               0x01
#define _CWG1DBF1               0x02
#define _CWG1DBF2               0x04
#define _CWG1DBF3               0x08
#define _CWG1DBF4               0x10
#define _CWG1DBF5               0x20

//==============================================================================


//==============================================================================
//        CWG1CON0 Bits

extern __at(0x0693) __sfr CWG1CON0;

typedef struct
  {
  unsigned G1CS0                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned G1POLA               : 1;
  unsigned G1POLB               : 1;
  unsigned G1OEA                : 1;
  unsigned G1OEB                : 1;
  unsigned G1EN                 : 1;
  } __CWG1CON0bits_t;

extern __at(0x0693) volatile __CWG1CON0bits_t CWG1CON0bits;

#define _G1CS0                  0x01
#define _G1POLA                 0x08
#define _G1POLB                 0x10
#define _G1OEA                  0x20
#define _G1OEB                  0x40
#define _G1EN                   0x80

//==============================================================================


//==============================================================================
//        CWG1CON1 Bits

extern __at(0x0694) __sfr CWG1CON1;

typedef union
  {
  struct
    {
    unsigned G1IS0              : 1;
    unsigned G1IS1              : 1;
    unsigned G1IS2              : 1;
    unsigned                    : 1;
    unsigned G1ASDLA0           : 1;
    unsigned G1ASDLA1           : 1;
    unsigned G1ASDLB0           : 1;
    unsigned G1ASDLB1           : 1;
    };

  struct
    {
    unsigned G1IS               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 4;
    unsigned G1ASDLA            : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned G1ASDLB            : 2;
    };
  } __CWG1CON1bits_t;

extern __at(0x0694) volatile __CWG1CON1bits_t CWG1CON1bits;

#define _G1IS0                  0x01
#define _G1IS1                  0x02
#define _G1IS2                  0x04
#define _G1ASDLA0               0x10
#define _G1ASDLA1               0x20
#define _G1ASDLB0               0x40
#define _G1ASDLB1               0x80

//==============================================================================


//==============================================================================
//        CWG1CON2 Bits

extern __at(0x0695) __sfr CWG1CON2;

typedef struct
  {
  unsigned                      : 1;
  unsigned G1ASDSPPS            : 1;
  unsigned G1ASDSC1             : 1;
  unsigned G1ASDSC2             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned G1ARSEN              : 1;
  unsigned G1ASE                : 1;
  } __CWG1CON2bits_t;

extern __at(0x0695) volatile __CWG1CON2bits_t CWG1CON2bits;

#define _G1ASDSPPS              0x02
#define _G1ASDSC1               0x04
#define _G1ASDSC2               0x08
#define _G1ARSEN                0x40
#define _G1ASE                  0x80

//==============================================================================


//==============================================================================
//        PWMEN Bits

extern __at(0x0D8E) __sfr PWMEN;

typedef union
  {
  struct
    {
    unsigned PWM1EN_A           : 1;
    unsigned PWM2EN_A           : 1;
    unsigned PWM3EN_A           : 1;
    unsigned PWM4EN_A           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MPWM1EN            : 1;
    unsigned MPWM2EN            : 1;
    unsigned MPWM3EN            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWMENbits_t;

extern __at(0x0D8E) volatile __PWMENbits_t PWMENbits;

#define _PWM1EN_A               0x01
#define _MPWM1EN                0x01
#define _PWM2EN_A               0x02
#define _MPWM2EN                0x02
#define _PWM3EN_A               0x04
#define _MPWM3EN                0x04
#define _PWM4EN_A               0x08

//==============================================================================


//==============================================================================
//        PWMLD Bits

extern __at(0x0D8F) __sfr PWMLD;

typedef union
  {
  struct
    {
    unsigned PWM1LDA_A          : 1;
    unsigned PWM2LDA_A          : 1;
    unsigned PWM3LDA_A          : 1;
    unsigned PWM4LDA_A          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MPWM1LD            : 1;
    unsigned MPWM2LD            : 1;
    unsigned MPWM3LD            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWMLDbits_t;

extern __at(0x0D8F) volatile __PWMLDbits_t PWMLDbits;

#define _PWM1LDA_A              0x01
#define _MPWM1LD                0x01
#define _PWM2LDA_A              0x02
#define _MPWM2LD                0x02
#define _PWM3LDA_A              0x04
#define _MPWM3LD                0x04
#define _PWM4LDA_A              0x08

//==============================================================================


//==============================================================================
//        PWMOUT Bits

extern __at(0x0D90) __sfr PWMOUT;

typedef union
  {
  struct
    {
    unsigned PWM1OUT_A          : 1;
    unsigned PWM2OUT_A          : 1;
    unsigned PWM3OUT_A          : 1;
    unsigned PWM4OUT_A          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MPWM1OUT           : 1;
    unsigned MPWM2OUT           : 1;
    unsigned MPWM3OUT           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWMOUTbits_t;

extern __at(0x0D90) volatile __PWMOUTbits_t PWMOUTbits;

#define _PWM1OUT_A              0x01
#define _MPWM1OUT               0x01
#define _PWM2OUT_A              0x02
#define _MPWM2OUT               0x02
#define _PWM3OUT_A              0x04
#define _MPWM3OUT               0x04
#define _PWM4OUT_A              0x08

//==============================================================================

extern __at(0x0D91) __sfr PWM1PH;

//==============================================================================
//        PWM1PHL Bits

extern __at(0x0D91) __sfr PWM1PHL;

typedef struct
  {
  unsigned PWM1PHL0             : 1;
  unsigned PWM1PHL1             : 1;
  unsigned PWM1PHL2             : 1;
  unsigned PWM1PHL3             : 1;
  unsigned PWM1PHL4             : 1;
  unsigned PWM1PHL5             : 1;
  unsigned PWM1PHL6             : 1;
  unsigned PWM1PHL7             : 1;
  } __PWM1PHLbits_t;

extern __at(0x0D91) volatile __PWM1PHLbits_t PWM1PHLbits;

#define _PWM1PHL0               0x01
#define _PWM1PHL1               0x02
#define _PWM1PHL2               0x04
#define _PWM1PHL3               0x08
#define _PWM1PHL4               0x10
#define _PWM1PHL5               0x20
#define _PWM1PHL6               0x40
#define _PWM1PHL7               0x80

//==============================================================================


//==============================================================================
//        PWM1PHH Bits

extern __at(0x0D92) __sfr PWM1PHH;

typedef struct
  {
  unsigned PWM1PHH0             : 1;
  unsigned PWM1PHH1             : 1;
  unsigned PWM1PHH2             : 1;
  unsigned PWM1PHH3             : 1;
  unsigned PWM1PHH4             : 1;
  unsigned PWM1PHH5             : 1;
  unsigned PWM1PHH6             : 1;
  unsigned PWM1PHH7             : 1;
  } __PWM1PHHbits_t;

extern __at(0x0D92) volatile __PWM1PHHbits_t PWM1PHHbits;

#define _PWM1PHH0               0x01
#define _PWM1PHH1               0x02
#define _PWM1PHH2               0x04
#define _PWM1PHH3               0x08
#define _PWM1PHH4               0x10
#define _PWM1PHH5               0x20
#define _PWM1PHH6               0x40
#define _PWM1PHH7               0x80

//==============================================================================

extern __at(0x0D93) __sfr PWM1DC;

//==============================================================================
//        PWM1DCL Bits

extern __at(0x0D93) __sfr PWM1DCL;

typedef struct
  {
  unsigned PWM1DCL0             : 1;
  unsigned PWM1DCL1             : 1;
  unsigned PWM1DCL2             : 1;
  unsigned PWM1DCL3             : 1;
  unsigned PWM1DCL4             : 1;
  unsigned PWM1DCL5             : 1;
  unsigned PWM1DCL6             : 1;
  unsigned PWM1DCL7             : 1;
  } __PWM1DCLbits_t;

extern __at(0x0D93) volatile __PWM1DCLbits_t PWM1DCLbits;

#define _PWM1DCL0               0x01
#define _PWM1DCL1               0x02
#define _PWM1DCL2               0x04
#define _PWM1DCL3               0x08
#define _PWM1DCL4               0x10
#define _PWM1DCL5               0x20
#define _PWM1DCL6               0x40
#define _PWM1DCL7               0x80

//==============================================================================


//==============================================================================
//        PWM1DCH Bits

extern __at(0x0D94) __sfr PWM1DCH;

typedef struct
  {
  unsigned PWM1DCH0             : 1;
  unsigned PWM1DCH1             : 1;
  unsigned PWM1DCH2             : 1;
  unsigned PWM1DCH3             : 1;
  unsigned PWM1DCH4             : 1;
  unsigned PWM1DCH5             : 1;
  unsigned PWM1DCH6             : 1;
  unsigned PWM1DCH7             : 1;
  } __PWM1DCHbits_t;

extern __at(0x0D94) volatile __PWM1DCHbits_t PWM1DCHbits;

#define _PWM1DCH0               0x01
#define _PWM1DCH1               0x02
#define _PWM1DCH2               0x04
#define _PWM1DCH3               0x08
#define _PWM1DCH4               0x10
#define _PWM1DCH5               0x20
#define _PWM1DCH6               0x40
#define _PWM1DCH7               0x80

//==============================================================================

extern __at(0x0D95) __sfr PWM1PR;

//==============================================================================
//        PWM1PRL Bits

extern __at(0x0D95) __sfr PWM1PRL;

typedef struct
  {
  unsigned PWM1PRL0             : 1;
  unsigned PWM1PRL1             : 1;
  unsigned PWM1PRL2             : 1;
  unsigned PWM1PRL3             : 1;
  unsigned PWM1PRL4             : 1;
  unsigned PWM1PRL5             : 1;
  unsigned PWM1PRL6             : 1;
  unsigned PWM1PRL7             : 1;
  } __PWM1PRLbits_t;

extern __at(0x0D95) volatile __PWM1PRLbits_t PWM1PRLbits;

