OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1579.h
extern __at(0x0DAC) volatile __PWM2INTEbits_t PWM2INTEbits;

#define _PWM2INTE_PRIE          0x01
#define _PWM2INTE_PWM2PRIE      0x01
#define _PWM2INTE_DCIE          0x02
#define _PWM2INTE_PWM2DCIE      0x02
#define _PWM2INTE_PHIE          0x04
#define _PWM2INTE_PWM2PHIE      0x04
#define _PWM2INTE_OFIE          0x08
#define _PWM2INTE_PWM2OFIE      0x08

//==============================================================================


//==============================================================================
//        PWM2INTF Bits

extern __at(0x0DAD) __sfr PWM2INTF;

typedef union
  {
  struct
    {
    unsigned PRIF               : 1;
    unsigned DCIF               : 1;
    unsigned PHIF               : 1;
    unsigned OFIF               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM2PRIF           : 1;
    unsigned PWM2DCIF           : 1;
    unsigned PWM2PHIF           : 1;
    unsigned PWM2OFIF           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM2INTFbits_t;

extern __at(0x0DAD) volatile __PWM2INTFbits_t PWM2INTFbits;

#define _PWM2INTF_PRIF          0x01
#define _PWM2INTF_PWM2PRIF      0x01
#define _PWM2INTF_DCIF          0x02
#define _PWM2INTF_PWM2DCIF      0x02
#define _PWM2INTF_PHIF          0x04
#define _PWM2INTF_PWM2PHIF      0x04
#define _PWM2INTF_OFIF          0x08
#define _PWM2INTF_PWM2OFIF      0x08

//==============================================================================


//==============================================================================
//        PWM2INTFLG Bits

extern __at(0x0DAD) __sfr PWM2INTFLG;

typedef union
  {
  struct
    {
    unsigned PRIF               : 1;
    unsigned DCIF               : 1;
    unsigned PHIF               : 1;
    unsigned OFIF               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM2PRIF           : 1;
    unsigned PWM2DCIF           : 1;
    unsigned PWM2PHIF           : 1;
    unsigned PWM2OFIF           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM2INTFLGbits_t;

extern __at(0x0DAD) volatile __PWM2INTFLGbits_t PWM2INTFLGbits;

#define _PWM2INTFLG_PRIF        0x01
#define _PWM2INTFLG_PWM2PRIF    0x01
#define _PWM2INTFLG_DCIF        0x02
#define _PWM2INTFLG_PWM2DCIF    0x02
#define _PWM2INTFLG_PHIF        0x04
#define _PWM2INTFLG_PWM2PHIF    0x04
#define _PWM2INTFLG_OFIF        0x08
#define _PWM2INTFLG_PWM2OFIF    0x08

//==============================================================================


//==============================================================================
//        PWM2CLKCON Bits

extern __at(0x0DAE) __sfr PWM2CLKCON;

typedef union
  {
  struct
    {
    unsigned PWM2CS0            : 1;
    unsigned PWM2CS1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM2PS0            : 1;
    unsigned PWM2PS1            : 1;
    unsigned PWM2PS2            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PS0                : 1;
    unsigned PS1                : 1;
    unsigned PS2                : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM2CS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned CS                 : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PS                 : 3;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PWM2PS             : 3;
    unsigned                    : 1;
    };
  } __PWM2CLKCONbits_t;

extern __at(0x0DAE) volatile __PWM2CLKCONbits_t PWM2CLKCONbits;

#define _PWM2CLKCON_PWM2CS0     0x01
#define _PWM2CLKCON_CS0         0x01
#define _PWM2CLKCON_PWM2CS1     0x02
#define _PWM2CLKCON_CS1         0x02
#define _PWM2CLKCON_PWM2PS0     0x10
#define _PWM2CLKCON_PS0         0x10
#define _PWM2CLKCON_PWM2PS1     0x20
#define _PWM2CLKCON_PS1         0x20
#define _PWM2CLKCON_PWM2PS2     0x40
#define _PWM2CLKCON_PS2         0x40

//==============================================================================


//==============================================================================
//        PWM2LDCON Bits

extern __at(0x0DAF) __sfr PWM2LDCON;

typedef union
  {
  struct
    {
    unsigned PWM2LDS0           : 1;
    unsigned PWM2LDS1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned LDT                : 1;
    unsigned LDA                : 1;
    };

  struct
    {
    unsigned LDS0               : 1;
    unsigned LDS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM2LDM            : 1;
    unsigned PWM2LD             : 1;
    };

  struct
    {
    unsigned PWM2LDS            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned LDS                : 2;
    unsigned                    : 6;
    };
  } __PWM2LDCONbits_t;

extern __at(0x0DAF) volatile __PWM2LDCONbits_t PWM2LDCONbits;

#define _PWM2LDCON_PWM2LDS0     0x01
#define _PWM2LDCON_LDS0         0x01
#define _PWM2LDCON_PWM2LDS1     0x02
#define _PWM2LDCON_LDS1         0x02
#define _PWM2LDCON_LDT          0x40
#define _PWM2LDCON_PWM2LDM      0x40
#define _PWM2LDCON_LDA          0x80
#define _PWM2LDCON_PWM2LD       0x80

//==============================================================================


//==============================================================================
//        PWM2OFCON Bits

extern __at(0x0DB0) __sfr PWM2OFCON;

typedef union
  {
  struct
    {
    unsigned PWM2OFS0           : 1;
    unsigned PWM2OFS1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OFO                : 1;
    unsigned PWM2OFM0           : 1;
    unsigned PWM2OFM1           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OFS0               : 1;
    unsigned OFS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM2OFMC           : 1;
    unsigned OFM0               : 1;
    unsigned OFM1               : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OFS                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned PWM2OFS            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 5;
    unsigned PWM2OFM            : 2;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 5;
    unsigned OFM                : 2;
    unsigned                    : 1;
    };
  } __PWM2OFCONbits_t;

extern __at(0x0DB0) volatile __PWM2OFCONbits_t PWM2OFCONbits;

